<?php 
	// example
	/*$a = 4;
	$b = 3;

	$c = $a > $b; //в переменную $c запишется true*/

	/*$a = 3;
	$b = 4;
	$c = $a < 10 && $b < 10; 
	echo $c;*/

	/*function func($a, $b)
	{
		if($a > $b){
			return true;
		} else {
			return false;
		}
	}*/

	/*function func($a, $b){
		return $a > $b;
	}*/
	// example

	/*Тема: Задачи на приемы работы с логическими значениями

	1. Сделайте функцию, которая параметрами принимает 2 числа. Если эти числа равны - пусть функция вернет true, а если не равны - false. 
	function func($a, $b){
		return $a == $b;
	}

	2. Сделайте функцию, которая параметрами принимает 2 числа. Если их сумма больше 10 - пусть функция вернет true, а если нет - false.
	function func($a, $b){
		return ($a + $b) > 10; 
	}

	3. Сделайте функцию, которая параметром принимает число и проверяет - отрицательное оно или нет. Если отрицательное - пусть функция вернет true, а если нет - false.
	function func($a){
		return $a < 0;
	}*/



?>