
<?php 
	/*--------EXAMPLE---------
	function cube($num){
		return $num * $num * $num;
	}
	--------EXAMPLE----------*/

	/*Тема: Простые функции

	1. Сделайте функцию, которая возвращает квадрат числа. Число передается параметром.
	function square($num){
		return $num * $num;
	}

	2. Сделайте функцию, которая возвращает сумму двух чисел. Числа передаются параметрами функции.
	function sum($num1, $num2){
		return $num1 + $num2;
	}

	3. Сделайте функцию, которая отнимает от первого числа второе и делит на третье.
	function subDel($num1, $num2, $num3){
		return ($num1 - $num2)/$num3;
	}

	4. Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке.
	function dayOfWeek($num){
		$week = [1=>'пн',"вт","ср","чт","пт","сб","вс"];
		return $week[$num];
	}*/

?>



