<?php 
	// example
	/*for($i = 1; $i <= 9; $i++){
		for($j = 1; $j <= 3; $j++){
			echo $i;
		}
	}*/

	/*$str = '';
	for($i = 0; $i < 10; $i++){
		$str.='x';
	}
	echo $str;*/

	/*$str = '';
	for($i = 0; $i < 10; $i++){
		$str.="x";
		echo $str."<br>";
	}*/

	/*$str = '';
	for($i=1; $i <= 9; $i++){
		$str.= $i;
	}
	echo $str;*/

	/*for($i=1; $i <= 9; $i++){
		for($j=1;$j<=3;$j++){
			echo $i;
		}
		echo '<br>';
	}*/

	/*$str = '';
	for($i=1; $i <= 9; $i++){
		for($j=1; $j<=$i; $j++){
			echo $i;
		}
		echo "<br>";
	}*/

	/*for($i = 1; $i <= 9; $i++){
		$str = '';
		for($j = 1; $j<= $i; $j++){
			$str.=$i;
		}
		echo $str."<br>";
	}*/
	/*
	$num = 500;
	while($num > 10){
		$num = $num / 2;
	}
	echo $num;*/

	/*for($num = 500; $num > 10; $num = $num / 2);
	echo $num;*/
	// example

	/*Тема: Задачи на приемы работы с циклами

	1. С помощью цикла for сформируйте строку '123456789' и запишите ее в переменную $str.
	$str = '';
	for($i = 1; $i <= 9; $i++){
		$str.=$i;
	}
	echo $str;

	2. С помощью цикла for сформируйте строку '987654321' и запишите ее в переменную $str.
	$str = '';
	for($i = 9; $i >= 1; $i--){
		$str.=$i;
	}
	echo $str;

	3. С помощью цикла for сформируйте строку '-1-2-3-4-5-6-7-8-9-' и запишите ее в переменную $str.
	$str = '';
	for($i = 1; $i <= 9; $i++){
		$str.="-".$i;
	}
	echo $str."-";

	4. Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5:
	$str = "";
	for($i = 1; $i <= 20; $i++){
		$str.="x";
		echo $str."<br>";
	}

	5. С помощью двух вложенных циклов нарисуйте следующую пирамидку:
	for($i=1; $i <= 9; $i++){
		for($j=0; $j <= $i; $j++){
			echo $i;
		}
		echo "<br>";
	}

	6. Нарисуйте пирамиду, как показано на рисунке, воспользовавшись циклом for:
	$str = '';
	for($i = 1; $i <= 5; $i++){
		$str.="xx";
		echo $str."<br>";
	}*/
?>