<?php
error_reporting(-1);

/*Арифметические операторы
+$a	Идентичность	Конвертация $a в int или float, что более подходит.
-$a	Отрицание	Смена знака $a.
$a + $b	Сложение	Сумма $a и $b.
$a - $b	Вычитание	Разность $a и $b.
$a * $b	Умножение	Произведение $a и $b.
$a / $b	Деление	Частное от деления $a на $b.
$a % $b	Деление по модулю	Целочисленный остаток от деления $a на $b.
$a ** $b	Возведение в степень	Возведение $a в степень $b. Добавлено в PHP 5.6.


*/

//5 и 3 - это операнты.
//echo 5 + 3;
//echo -(5 - 3) * 5; //приоритет оператора.
//echo 5 / 3;
//echo 20 % 3;
//Возведение в степень.
//echo 5 ** 3;
//echo pow(5, 3);

//Присваивание
//echo "$a\n"; // печатает 3
//$a = 7;
//echo "$a\n"; // печатает 3
//echo "$b\n"; // печатает 3

/*$a = 5 + 3;
//Присваивание по ссылке
$b = &$a; // $b - это ссылка на $a
var_dump($a);
$a = 7;
var_dump($a);
var_dump($b);*/

/*
//Приведение типов
echo 5 + '33 test'; // 38
echo 5 + 'te3st'; // 5
*/


